SiliconLabs/Gecko_SDK_discontinued/platform/Device/SiliconLabs/EFR32MG2P/Include/efr32mg2p_vdac.h
/* Bit fields for VDAC OPA_MUX */
#define _VDAC_OPA_MUX_RESETVALUE                           0x0016F2F1UL                            /**< Default value for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_MASK                                 0x0717FFFFUL                            /**< Mask for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_SHIFT                         0                                       /**< Shift value for VDAC_OPAPOSSEL */
#define _VDAC_OPA_MUX_POSSEL_MASK                          0xFFUL                                  /**< Bit mask for VDAC_OPAPOSSEL */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH0                    0x00000000UL                            /**< Mode APORT0XCH0 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH1                    0x00000001UL                            /**< Mode APORT0XCH1 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH2                    0x00000002UL                            /**< Mode APORT0XCH2 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH3                    0x00000003UL                            /**< Mode APORT0XCH3 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH4                    0x00000004UL                            /**< Mode APORT0XCH4 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH5                    0x00000005UL                            /**< Mode APORT0XCH5 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH6                    0x00000006UL                            /**< Mode APORT0XCH6 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH7                    0x00000007UL                            /**< Mode APORT0XCH7 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH8                    0x00000008UL                            /**< Mode APORT0XCH8 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH9                    0x00000009UL                            /**< Mode APORT0XCH9 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH10                   0x0000000AUL                            /**< Mode APORT0XCH10 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH11                   0x0000000BUL                            /**< Mode APORT0XCH11 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH12                   0x0000000CUL                            /**< Mode APORT0XCH12 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH13                   0x0000000DUL                            /**< Mode APORT0XCH13 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH14                   0x0000000EUL                            /**< Mode APORT0XCH14 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0XCH15                   0x0000000FUL                            /**< Mode APORT0XCH15 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH0                    0x00000010UL                            /**< Mode APORT0YCH0 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH1                    0x00000011UL                            /**< Mode APORT0YCH1 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH2                    0x00000012UL                            /**< Mode APORT0YCH2 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH3                    0x00000013UL                            /**< Mode APORT0YCH3 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH4                    0x00000014UL                            /**< Mode APORT0YCH4 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH5                    0x00000015UL                            /**< Mode APORT0YCH5 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH6                    0x00000016UL                            /**< Mode APORT0YCH6 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH7                    0x00000017UL                            /**< Mode APORT0YCH7 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH8                    0x00000018UL                            /**< Mode APORT0YCH8 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH9                    0x00000019UL                            /**< Mode APORT0YCH9 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH10                   0x0000001AUL                            /**< Mode APORT0YCH10 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH11                   0x0000001BUL                            /**< Mode APORT0YCH11 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH12                   0x0000001CUL                            /**< Mode APORT0YCH12 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH13                   0x0000001DUL                            /**< Mode APORT0YCH13 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH14                   0x0000001EUL                            /**< Mode APORT0YCH14 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT0YCH15                   0x0000001FUL                            /**< Mode APORT0YCH15 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH0                    0x00000020UL                            /**< Mode APORT1XCH0 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH2                    0x00000021UL                            /**< Mode APORT1XCH2 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH4                    0x00000022UL                            /**< Mode APORT1XCH4 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH6                    0x00000023UL                            /**< Mode APORT1XCH6 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH8                    0x00000024UL                            /**< Mode APORT1XCH8 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH10                   0x00000025UL                            /**< Mode APORT1XCH10 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH12                   0x00000026UL                            /**< Mode APORT1XCH12 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH14                   0x00000027UL                            /**< Mode APORT1XCH14 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH16                   0x00000028UL                            /**< Mode APORT1XCH16 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH18                   0x00000029UL                            /**< Mode APORT1XCH18 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH20                   0x0000002AUL                            /**< Mode APORT1XCH20 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH22                   0x0000002BUL                            /**< Mode APORT1XCH22 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH24                   0x0000002CUL                            /**< Mode APORT1XCH24 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH26                   0x0000002DUL                            /**< Mode APORT1XCH26 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH28                   0x0000002EUL                            /**< Mode APORT1XCH28 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1XCH30                   0x0000002FUL                            /**< Mode APORT1XCH30 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH1                    0x00000030UL                            /**< Mode APORT1YCH1 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH3                    0x00000031UL                            /**< Mode APORT1YCH3 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH5                    0x00000032UL                            /**< Mode APORT1YCH5 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH7                    0x00000033UL                            /**< Mode APORT1YCH7 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH9                    0x00000034UL                            /**< Mode APORT1YCH9 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH11                   0x00000035UL                            /**< Mode APORT1YCH11 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH13                   0x00000036UL                            /**< Mode APORT1YCH13 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH15                   0x00000037UL                            /**< Mode APORT1YCH15 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH17                   0x00000038UL                            /**< Mode APORT1YCH17 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH19                   0x00000039UL                            /**< Mode APORT1YCH19 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH21                   0x0000003AUL                            /**< Mode APORT1YCH21 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH23                   0x0000003BUL                            /**< Mode APORT1YCH23 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH25                   0x0000003CUL                            /**< Mode APORT1YCH25 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH27                   0x0000003DUL                            /**< Mode APORT1YCH27 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH29                   0x0000003EUL                            /**< Mode APORT1YCH29 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT1YCH31                   0x0000003FUL                            /**< Mode APORT1YCH31 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH1                    0x00000040UL                            /**< Mode APORT2XCH1 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH2                    0x00000041UL                            /**< Mode APORT2XCH2 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH5                    0x00000042UL                            /**< Mode APORT2XCH5 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH7                    0x00000043UL                            /**< Mode APORT2XCH7 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH9                    0x00000044UL                            /**< Mode APORT2XCH9 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH11                   0x00000045UL                            /**< Mode APORT2XCH11 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH13                   0x00000046UL                            /**< Mode APORT2XCH13 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH15                   0x00000047UL                            /**< Mode APORT2XCH15 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH17                   0x00000048UL                            /**< Mode APORT2XCH17 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH19                   0x00000049UL                            /**< Mode APORT2XCH19 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH21                   0x0000004AUL                            /**< Mode APORT2XCH21 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH23                   0x0000004BUL                            /**< Mode APORT2XCH23 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH25                   0x0000004CUL                            /**< Mode APORT2XCH25 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH27                   0x0000004DUL                            /**< Mode APORT2XCH27 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH29                   0x0000004EUL                            /**< Mode APORT2XCH29 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2XCH31                   0x0000004FUL                            /**< Mode APORT2XCH31 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH0                    0x00000050UL                            /**< Mode APORT2YCH0 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH2                    0x00000051UL                            /**< Mode APORT2YCH2 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH4                    0x00000052UL                            /**< Mode APORT2YCH4 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH6                    0x00000053UL                            /**< Mode APORT2YCH6 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH8                    0x00000054UL                            /**< Mode APORT2YCH8 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH10                   0x00000055UL                            /**< Mode APORT2YCH10 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH12                   0x00000056UL                            /**< Mode APORT2YCH12 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH14                   0x00000057UL                            /**< Mode APORT2YCH14 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH16                   0x00000058UL                            /**< Mode APORT2YCH16 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH18                   0x00000059UL                            /**< Mode APORT2YCH18 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH20                   0x0000005AUL                            /**< Mode APORT2YCH20 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH22                   0x0000005BUL                            /**< Mode APORT2YCH22 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH24                   0x0000005CUL                            /**< Mode APORT2YCH24 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH26                   0x0000005DUL                            /**< Mode APORT2YCH26 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH28                   0x0000005EUL                            /**< Mode APORT2YCH28 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT2YCH30                   0x0000005FUL                            /**< Mode APORT2YCH30 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH0                    0x00000060UL                            /**< Mode APORT3XCH0 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH2                    0x00000061UL                            /**< Mode APORT3XCH2 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH4                    0x00000062UL                            /**< Mode APORT3XCH4 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH6                    0x00000063UL                            /**< Mode APORT3XCH6 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH8                    0x00000064UL                            /**< Mode APORT3XCH8 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH10                   0x00000065UL                            /**< Mode APORT3XCH10 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH12                   0x00000066UL                            /**< Mode APORT3XCH12 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH14                   0x00000067UL                            /**< Mode APORT3XCH14 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH16                   0x00000068UL                            /**< Mode APORT3XCH16 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH18                   0x00000069UL                            /**< Mode APORT3XCH18 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH20                   0x0000006AUL                            /**< Mode APORT3XCH20 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH22                   0x0000006BUL                            /**< Mode APORT3XCH22 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH24                   0x0000006CUL                            /**< Mode APORT3XCH24 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH26                   0x0000006DUL                            /**< Mode APORT3XCH26 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH28                   0x0000006EUL                            /**< Mode APORT3XCH28 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3XCH30                   0x0000006FUL                            /**< Mode APORT3XCH30 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH1                    0x00000070UL                            /**< Mode APORT3YCH1 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH3                    0x00000071UL                            /**< Mode APORT3YCH3 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH5                    0x00000072UL                            /**< Mode APORT3YCH5 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH7                    0x00000073UL                            /**< Mode APORT3YCH7 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH9                    0x00000074UL                            /**< Mode APORT3YCH9 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH11                   0x00000075UL                            /**< Mode APORT3YCH11 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH13                   0x00000076UL                            /**< Mode APORT3YCH13 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH15                   0x00000077UL                            /**< Mode APORT3YCH15 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH17                   0x00000078UL                            /**< Mode APORT3YCH17 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH19                   0x00000079UL                            /**< Mode APORT3YCH19 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH21                   0x0000007AUL                            /**< Mode APORT3YCH21 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH23                   0x0000007BUL                            /**< Mode APORT3YCH23 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH25                   0x0000007CUL                            /**< Mode APORT3YCH25 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH27                   0x0000007DUL                            /**< Mode APORT3YCH27 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH29                   0x0000007EUL                            /**< Mode APORT3YCH29 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT3YCH31                   0x0000007FUL                            /**< Mode APORT3YCH31 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH1                    0x00000080UL                            /**< Mode APORT4XCH1 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH3                    0x00000081UL                            /**< Mode APORT4XCH3 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH5                    0x00000082UL                            /**< Mode APORT4XCH5 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH7                    0x00000083UL                            /**< Mode APORT4XCH7 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH9                    0x00000084UL                            /**< Mode APORT4XCH9 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH11                   0x00000085UL                            /**< Mode APORT4XCH11 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH13                   0x00000086UL                            /**< Mode APORT4XCH13 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH15                   0x00000087UL                            /**< Mode APORT4XCH15 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH17                   0x00000088UL                            /**< Mode APORT4XCH17 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH19                   0x00000089UL                            /**< Mode APORT4XCH19 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH21                   0x0000008AUL                            /**< Mode APORT4XCH21 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH23                   0x0000008BUL                            /**< Mode APORT4XCH23 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH25                   0x0000008CUL                            /**< Mode APORT4XCH25 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH27                   0x0000008DUL                            /**< Mode APORT4XCH27 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH29                   0x0000008EUL                            /**< Mode APORT4XCH29 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4XCH31                   0x0000008FUL                            /**< Mode APORT4XCH31 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH0                    0x00000090UL                            /**< Mode APORT4YCH0 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH2                    0x00000091UL                            /**< Mode APORT4YCH2 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH4                    0x00000092UL                            /**< Mode APORT4YCH4 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH6                    0x00000093UL                            /**< Mode APORT4YCH6 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH8                    0x00000094UL                            /**< Mode APORT4YCH8 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH10                   0x00000095UL                            /**< Mode APORT4YCH10 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH12                   0x00000096UL                            /**< Mode APORT4YCH12 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH14                   0x00000097UL                            /**< Mode APORT4YCH14 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH16                   0x00000098UL                            /**< Mode APORT4YCH16 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH18                   0x00000099UL                            /**< Mode APORT4YCH18 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH20                   0x0000009AUL                            /**< Mode APORT4YCH20 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH22                   0x0000009BUL                            /**< Mode APORT4YCH22 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH24                   0x0000009CUL                            /**< Mode APORT4YCH24 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH26                   0x0000009DUL                            /**< Mode APORT4YCH26 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH28                   0x0000009EUL                            /**< Mode APORT4YCH28 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_APORT4YCH30                   0x0000009FUL                            /**< Mode APORT4YCH30 for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_DISABLE                       0x000000F0UL                            /**< Mode DISABLE for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_DEFAULT                       0x000000F1UL                            /**< Mode DEFAULT for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_DAC                           0x000000F1UL                            /**< Mode DAC for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_POSPAD                        0x000000F2UL                            /**< Mode POSPAD for VDAC_OPA_MUX */
#define _VDAC_OPA_MUX_POSSEL_OPANEXT                       0x000000F3UL                            /**< Mode OPANEXT for VDAC_OPA_MUX */
