SiliconLabs/Gecko_SDK_discontinued/platform/Device/SiliconLabs/EFR32MG2P/Include/efr32mg2p_vdac.h
#define _VDAC_OPA_MUX_POSSEL_OPATAP                        0x000000F4UL                            /**< Mode OPATAP for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH0                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH0 << 0)  /**< Shifted mode APORT0XCH0 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH1                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH1 << 0)  /**< Shifted mode APORT0XCH1 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH2                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH2 << 0)  /**< Shifted mode APORT0XCH2 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH3                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH3 << 0)  /**< Shifted mode APORT0XCH3 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH4                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH4 << 0)  /**< Shifted mode APORT0XCH4 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH5                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH5 << 0)  /**< Shifted mode APORT0XCH5 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH6                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH6 << 0)  /**< Shifted mode APORT0XCH6 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH7                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH7 << 0)  /**< Shifted mode APORT0XCH7 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH8                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH8 << 0)  /**< Shifted mode APORT0XCH8 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH9                     (_VDAC_OPA_MUX_POSSEL_APORT0XCH9 << 0)  /**< Shifted mode APORT0XCH9 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH10                    (_VDAC_OPA_MUX_POSSEL_APORT0XCH10 << 0) /**< Shifted mode APORT0XCH10 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH11                    (_VDAC_OPA_MUX_POSSEL_APORT0XCH11 << 0) /**< Shifted mode APORT0XCH11 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH12                    (_VDAC_OPA_MUX_POSSEL_APORT0XCH12 << 0) /**< Shifted mode APORT0XCH12 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH13                    (_VDAC_OPA_MUX_POSSEL_APORT0XCH13 << 0) /**< Shifted mode APORT0XCH13 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH14                    (_VDAC_OPA_MUX_POSSEL_APORT0XCH14 << 0) /**< Shifted mode APORT0XCH14 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0XCH15                    (_VDAC_OPA_MUX_POSSEL_APORT0XCH15 << 0) /**< Shifted mode APORT0XCH15 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH0                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH0 << 0)  /**< Shifted mode APORT0YCH0 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH1                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH1 << 0)  /**< Shifted mode APORT0YCH1 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH2                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH2 << 0)  /**< Shifted mode APORT0YCH2 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH3                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH3 << 0)  /**< Shifted mode APORT0YCH3 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH4                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH4 << 0)  /**< Shifted mode APORT0YCH4 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH5                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH5 << 0)  /**< Shifted mode APORT0YCH5 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH6                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH6 << 0)  /**< Shifted mode APORT0YCH6 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH7                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH7 << 0)  /**< Shifted mode APORT0YCH7 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH8                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH8 << 0)  /**< Shifted mode APORT0YCH8 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH9                     (_VDAC_OPA_MUX_POSSEL_APORT0YCH9 << 0)  /**< Shifted mode APORT0YCH9 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH10                    (_VDAC_OPA_MUX_POSSEL_APORT0YCH10 << 0) /**< Shifted mode APORT0YCH10 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH11                    (_VDAC_OPA_MUX_POSSEL_APORT0YCH11 << 0) /**< Shifted mode APORT0YCH11 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH12                    (_VDAC_OPA_MUX_POSSEL_APORT0YCH12 << 0) /**< Shifted mode APORT0YCH12 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH13                    (_VDAC_OPA_MUX_POSSEL_APORT0YCH13 << 0) /**< Shifted mode APORT0YCH13 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH14                    (_VDAC_OPA_MUX_POSSEL_APORT0YCH14 << 0) /**< Shifted mode APORT0YCH14 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT0YCH15                    (_VDAC_OPA_MUX_POSSEL_APORT0YCH15 << 0) /**< Shifted mode APORT0YCH15 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH0                     (_VDAC_OPA_MUX_POSSEL_APORT1XCH0 << 0)  /**< Shifted mode APORT1XCH0 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH2                     (_VDAC_OPA_MUX_POSSEL_APORT1XCH2 << 0)  /**< Shifted mode APORT1XCH2 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH4                     (_VDAC_OPA_MUX_POSSEL_APORT1XCH4 << 0)  /**< Shifted mode APORT1XCH4 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH6                     (_VDAC_OPA_MUX_POSSEL_APORT1XCH6 << 0)  /**< Shifted mode APORT1XCH6 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH8                     (_VDAC_OPA_MUX_POSSEL_APORT1XCH8 << 0)  /**< Shifted mode APORT1XCH8 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH10                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH10 << 0) /**< Shifted mode APORT1XCH10 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH12                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH12 << 0) /**< Shifted mode APORT1XCH12 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH14                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH14 << 0) /**< Shifted mode APORT1XCH14 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH16                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH16 << 0) /**< Shifted mode APORT1XCH16 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH18                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH18 << 0) /**< Shifted mode APORT1XCH18 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH20                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH20 << 0) /**< Shifted mode APORT1XCH20 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH22                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH22 << 0) /**< Shifted mode APORT1XCH22 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH24                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH24 << 0) /**< Shifted mode APORT1XCH24 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH26                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH26 << 0) /**< Shifted mode APORT1XCH26 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH28                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH28 << 0) /**< Shifted mode APORT1XCH28 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1XCH30                    (_VDAC_OPA_MUX_POSSEL_APORT1XCH30 << 0) /**< Shifted mode APORT1XCH30 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH1                     (_VDAC_OPA_MUX_POSSEL_APORT1YCH1 << 0)  /**< Shifted mode APORT1YCH1 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH3                     (_VDAC_OPA_MUX_POSSEL_APORT1YCH3 << 0)  /**< Shifted mode APORT1YCH3 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH5                     (_VDAC_OPA_MUX_POSSEL_APORT1YCH5 << 0)  /**< Shifted mode APORT1YCH5 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH7                     (_VDAC_OPA_MUX_POSSEL_APORT1YCH7 << 0)  /**< Shifted mode APORT1YCH7 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH9                     (_VDAC_OPA_MUX_POSSEL_APORT1YCH9 << 0)  /**< Shifted mode APORT1YCH9 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH11                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH11 << 0) /**< Shifted mode APORT1YCH11 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH13                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH13 << 0) /**< Shifted mode APORT1YCH13 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH15                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH15 << 0) /**< Shifted mode APORT1YCH15 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH17                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH17 << 0) /**< Shifted mode APORT1YCH17 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH19                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH19 << 0) /**< Shifted mode APORT1YCH19 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH21                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH21 << 0) /**< Shifted mode APORT1YCH21 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH23                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH23 << 0) /**< Shifted mode APORT1YCH23 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH25                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH25 << 0) /**< Shifted mode APORT1YCH25 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH27                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH27 << 0) /**< Shifted mode APORT1YCH27 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH29                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH29 << 0) /**< Shifted mode APORT1YCH29 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT1YCH31                    (_VDAC_OPA_MUX_POSSEL_APORT1YCH31 << 0) /**< Shifted mode APORT1YCH31 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH1                     (_VDAC_OPA_MUX_POSSEL_APORT2XCH1 << 0)  /**< Shifted mode APORT2XCH1 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH2                     (_VDAC_OPA_MUX_POSSEL_APORT2XCH2 << 0)  /**< Shifted mode APORT2XCH2 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH5                     (_VDAC_OPA_MUX_POSSEL_APORT2XCH5 << 0)  /**< Shifted mode APORT2XCH5 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH7                     (_VDAC_OPA_MUX_POSSEL_APORT2XCH7 << 0)  /**< Shifted mode APORT2XCH7 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH9                     (_VDAC_OPA_MUX_POSSEL_APORT2XCH9 << 0)  /**< Shifted mode APORT2XCH9 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH11                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH11 << 0) /**< Shifted mode APORT2XCH11 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH13                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH13 << 0) /**< Shifted mode APORT2XCH13 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH15                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH15 << 0) /**< Shifted mode APORT2XCH15 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH17                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH17 << 0) /**< Shifted mode APORT2XCH17 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH19                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH19 << 0) /**< Shifted mode APORT2XCH19 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH21                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH21 << 0) /**< Shifted mode APORT2XCH21 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH23                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH23 << 0) /**< Shifted mode APORT2XCH23 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH25                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH25 << 0) /**< Shifted mode APORT2XCH25 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH27                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH27 << 0) /**< Shifted mode APORT2XCH27 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH29                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH29 << 0) /**< Shifted mode APORT2XCH29 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2XCH31                    (_VDAC_OPA_MUX_POSSEL_APORT2XCH31 << 0) /**< Shifted mode APORT2XCH31 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH0                     (_VDAC_OPA_MUX_POSSEL_APORT2YCH0 << 0)  /**< Shifted mode APORT2YCH0 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH2                     (_VDAC_OPA_MUX_POSSEL_APORT2YCH2 << 0)  /**< Shifted mode APORT2YCH2 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH4                     (_VDAC_OPA_MUX_POSSEL_APORT2YCH4 << 0)  /**< Shifted mode APORT2YCH4 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH6                     (_VDAC_OPA_MUX_POSSEL_APORT2YCH6 << 0)  /**< Shifted mode APORT2YCH6 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH8                     (_VDAC_OPA_MUX_POSSEL_APORT2YCH8 << 0)  /**< Shifted mode APORT2YCH8 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH10                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH10 << 0) /**< Shifted mode APORT2YCH10 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH12                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH12 << 0) /**< Shifted mode APORT2YCH12 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH14                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH14 << 0) /**< Shifted mode APORT2YCH14 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH16                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH16 << 0) /**< Shifted mode APORT2YCH16 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH18                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH18 << 0) /**< Shifted mode APORT2YCH18 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH20                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH20 << 0) /**< Shifted mode APORT2YCH20 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH22                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH22 << 0) /**< Shifted mode APORT2YCH22 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH24                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH24 << 0) /**< Shifted mode APORT2YCH24 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH26                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH26 << 0) /**< Shifted mode APORT2YCH26 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH28                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH28 << 0) /**< Shifted mode APORT2YCH28 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT2YCH30                    (_VDAC_OPA_MUX_POSSEL_APORT2YCH30 << 0) /**< Shifted mode APORT2YCH30 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH0                     (_VDAC_OPA_MUX_POSSEL_APORT3XCH0 << 0)  /**< Shifted mode APORT3XCH0 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH2                     (_VDAC_OPA_MUX_POSSEL_APORT3XCH2 << 0)  /**< Shifted mode APORT3XCH2 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH4                     (_VDAC_OPA_MUX_POSSEL_APORT3XCH4 << 0)  /**< Shifted mode APORT3XCH4 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH6                     (_VDAC_OPA_MUX_POSSEL_APORT3XCH6 << 0)  /**< Shifted mode APORT3XCH6 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH8                     (_VDAC_OPA_MUX_POSSEL_APORT3XCH8 << 0)  /**< Shifted mode APORT3XCH8 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH10                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH10 << 0) /**< Shifted mode APORT3XCH10 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH12                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH12 << 0) /**< Shifted mode APORT3XCH12 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH14                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH14 << 0) /**< Shifted mode APORT3XCH14 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH16                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH16 << 0) /**< Shifted mode APORT3XCH16 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH18                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH18 << 0) /**< Shifted mode APORT3XCH18 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH20                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH20 << 0) /**< Shifted mode APORT3XCH20 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH22                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH22 << 0) /**< Shifted mode APORT3XCH22 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH24                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH24 << 0) /**< Shifted mode APORT3XCH24 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH26                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH26 << 0) /**< Shifted mode APORT3XCH26 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH28                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH28 << 0) /**< Shifted mode APORT3XCH28 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3XCH30                    (_VDAC_OPA_MUX_POSSEL_APORT3XCH30 << 0) /**< Shifted mode APORT3XCH30 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH1                     (_VDAC_OPA_MUX_POSSEL_APORT3YCH1 << 0)  /**< Shifted mode APORT3YCH1 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH3                     (_VDAC_OPA_MUX_POSSEL_APORT3YCH3 << 0)  /**< Shifted mode APORT3YCH3 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH5                     (_VDAC_OPA_MUX_POSSEL_APORT3YCH5 << 0)  /**< Shifted mode APORT3YCH5 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH7                     (_VDAC_OPA_MUX_POSSEL_APORT3YCH7 << 0)  /**< Shifted mode APORT3YCH7 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH9                     (_VDAC_OPA_MUX_POSSEL_APORT3YCH9 << 0)  /**< Shifted mode APORT3YCH9 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH11                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH11 << 0) /**< Shifted mode APORT3YCH11 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH13                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH13 << 0) /**< Shifted mode APORT3YCH13 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH15                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH15 << 0) /**< Shifted mode APORT3YCH15 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH17                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH17 << 0) /**< Shifted mode APORT3YCH17 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH19                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH19 << 0) /**< Shifted mode APORT3YCH19 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH21                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH21 << 0) /**< Shifted mode APORT3YCH21 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH23                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH23 << 0) /**< Shifted mode APORT3YCH23 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH25                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH25 << 0) /**< Shifted mode APORT3YCH25 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH27                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH27 << 0) /**< Shifted mode APORT3YCH27 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH29                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH29 << 0) /**< Shifted mode APORT3YCH29 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT3YCH31                    (_VDAC_OPA_MUX_POSSEL_APORT3YCH31 << 0) /**< Shifted mode APORT3YCH31 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH1                     (_VDAC_OPA_MUX_POSSEL_APORT4XCH1 << 0)  /**< Shifted mode APORT4XCH1 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH3                     (_VDAC_OPA_MUX_POSSEL_APORT4XCH3 << 0)  /**< Shifted mode APORT4XCH3 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH5                     (_VDAC_OPA_MUX_POSSEL_APORT4XCH5 << 0)  /**< Shifted mode APORT4XCH5 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH7                     (_VDAC_OPA_MUX_POSSEL_APORT4XCH7 << 0)  /**< Shifted mode APORT4XCH7 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH9                     (_VDAC_OPA_MUX_POSSEL_APORT4XCH9 << 0)  /**< Shifted mode APORT4XCH9 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH11                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH11 << 0) /**< Shifted mode APORT4XCH11 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH13                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH13 << 0) /**< Shifted mode APORT4XCH13 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH15                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH15 << 0) /**< Shifted mode APORT4XCH15 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH17                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH17 << 0) /**< Shifted mode APORT4XCH17 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH19                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH19 << 0) /**< Shifted mode APORT4XCH19 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH21                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH21 << 0) /**< Shifted mode APORT4XCH21 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH23                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH23 << 0) /**< Shifted mode APORT4XCH23 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH25                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH25 << 0) /**< Shifted mode APORT4XCH25 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH27                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH27 << 0) /**< Shifted mode APORT4XCH27 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH29                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH29 << 0) /**< Shifted mode APORT4XCH29 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4XCH31                    (_VDAC_OPA_MUX_POSSEL_APORT4XCH31 << 0) /**< Shifted mode APORT4XCH31 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH0                     (_VDAC_OPA_MUX_POSSEL_APORT4YCH0 << 0)  /**< Shifted mode APORT4YCH0 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH2                     (_VDAC_OPA_MUX_POSSEL_APORT4YCH2 << 0)  /**< Shifted mode APORT4YCH2 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH4                     (_VDAC_OPA_MUX_POSSEL_APORT4YCH4 << 0)  /**< Shifted mode APORT4YCH4 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH6                     (_VDAC_OPA_MUX_POSSEL_APORT4YCH6 << 0)  /**< Shifted mode APORT4YCH6 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH8                     (_VDAC_OPA_MUX_POSSEL_APORT4YCH8 << 0)  /**< Shifted mode APORT4YCH8 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH10                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH10 << 0) /**< Shifted mode APORT4YCH10 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH12                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH12 << 0) /**< Shifted mode APORT4YCH12 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH14                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH14 << 0) /**< Shifted mode APORT4YCH14 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH16                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH16 << 0) /**< Shifted mode APORT4YCH16 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH18                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH18 << 0) /**< Shifted mode APORT4YCH18 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH20                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH20 << 0) /**< Shifted mode APORT4YCH20 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH22                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH22 << 0) /**< Shifted mode APORT4YCH22 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH24                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH24 << 0) /**< Shifted mode APORT4YCH24 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH26                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH26 << 0) /**< Shifted mode APORT4YCH26 for VDAC_OPA_MUX */
#define VDAC_OPA_MUX_POSSEL_APORT4YCH28                    (_VDAC_OPA_MUX_POSSEL_APORT4YCH28 << 0) /**< Shifted mode APORT4YCH28 for VDAC_OPA_MUX */
