SiliconLabs/Gecko_SDK_discontinued/platform/Device/SiliconLabs/EFR32MG2P/Include/efr32mg2p_vdac.h
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH23              0x0000007BUL                                  /**< Mode APORT3YCH23 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH25              0x0000007CUL                                  /**< Mode APORT3YCH25 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH27              0x0000007DUL                                  /**< Mode APORT3YCH27 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH29              0x0000007EUL                                  /**< Mode APORT3YCH29 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH31              0x0000007FUL                                  /**< Mode APORT3YCH31 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH1               0x00000080UL                                  /**< Mode APORT4XCH1 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH3               0x00000081UL                                  /**< Mode APORT4XCH3 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH5               0x00000082UL                                  /**< Mode APORT4XCH5 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH7               0x00000083UL                                  /**< Mode APORT4XCH7 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH9               0x00000084UL                                  /**< Mode APORT4XCH9 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH11              0x00000085UL                                  /**< Mode APORT4XCH11 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH13              0x00000086UL                                  /**< Mode APORT4XCH13 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH15              0x00000087UL                                  /**< Mode APORT4XCH15 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH17              0x00000088UL                                  /**< Mode APORT4XCH17 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH19              0x00000089UL                                  /**< Mode APORT4XCH19 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH21              0x0000008AUL                                  /**< Mode APORT4XCH21 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH23              0x0000008BUL                                  /**< Mode APORT4XCH23 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH25              0x0000008CUL                                  /**< Mode APORT4XCH25 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH27              0x0000008DUL                                  /**< Mode APORT4XCH27 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH29              0x0000008EUL                                  /**< Mode APORT4XCH29 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4XCH31              0x0000008FUL                                  /**< Mode APORT4XCH31 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH0               0x00000090UL                                  /**< Mode APORT4YCH0 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH2               0x00000091UL                                  /**< Mode APORT4YCH2 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH4               0x00000092UL                                  /**< Mode APORT4YCH4 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH6               0x00000093UL                                  /**< Mode APORT4YCH6 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH8               0x00000094UL                                  /**< Mode APORT4YCH8 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH10              0x00000095UL                                  /**< Mode APORT4YCH10 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH12              0x00000096UL                                  /**< Mode APORT4YCH12 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH14              0x00000097UL                                  /**< Mode APORT4YCH14 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH16              0x00000098UL                                  /**< Mode APORT4YCH16 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH18              0x00000099UL                                  /**< Mode APORT4YCH18 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH20              0x0000009AUL                                  /**< Mode APORT4YCH20 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH22              0x0000009BUL                                  /**< Mode APORT4YCH22 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH24              0x0000009CUL                                  /**< Mode APORT4YCH24 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH26              0x0000009DUL                                  /**< Mode APORT4YCH26 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH28              0x0000009EUL                                  /**< Mode APORT4YCH28 for VDAC_OPA_OUT */
#define _VDAC_OPA_OUT_APORTOUTSEL_APORT4YCH30              0x0000009FUL                                  /**< Mode APORT4YCH30 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_DEFAULT                   (_VDAC_OPA_OUT_APORTOUTSEL_DEFAULT << 16)     /**< Shifted mode DEFAULT for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH0                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH0 << 16)  /**< Shifted mode APORT0XCH0 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH1                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH1 << 16)  /**< Shifted mode APORT0XCH1 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH2                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH2 << 16)  /**< Shifted mode APORT0XCH2 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH3                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH3 << 16)  /**< Shifted mode APORT0XCH3 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH4                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH4 << 16)  /**< Shifted mode APORT0XCH4 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH5                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH5 << 16)  /**< Shifted mode APORT0XCH5 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH6                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH6 << 16)  /**< Shifted mode APORT0XCH6 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH7                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH7 << 16)  /**< Shifted mode APORT0XCH7 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH8                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH8 << 16)  /**< Shifted mode APORT0XCH8 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH9                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH9 << 16)  /**< Shifted mode APORT0XCH9 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH10               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH10 << 16) /**< Shifted mode APORT0XCH10 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH11               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH11 << 16) /**< Shifted mode APORT0XCH11 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH12               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH12 << 16) /**< Shifted mode APORT0XCH12 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH13               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH13 << 16) /**< Shifted mode APORT0XCH13 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH14               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH14 << 16) /**< Shifted mode APORT0XCH14 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH15               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0XCH15 << 16) /**< Shifted mode APORT0XCH15 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH0                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH0 << 16)  /**< Shifted mode APORT0YCH0 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH1                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH1 << 16)  /**< Shifted mode APORT0YCH1 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH2                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH2 << 16)  /**< Shifted mode APORT0YCH2 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH3                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH3 << 16)  /**< Shifted mode APORT0YCH3 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH4                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH4 << 16)  /**< Shifted mode APORT0YCH4 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH5                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH5 << 16)  /**< Shifted mode APORT0YCH5 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH6                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH6 << 16)  /**< Shifted mode APORT0YCH6 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH7                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH7 << 16)  /**< Shifted mode APORT0YCH7 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH8                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH8 << 16)  /**< Shifted mode APORT0YCH8 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH9                (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH9 << 16)  /**< Shifted mode APORT0YCH9 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH10               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH10 << 16) /**< Shifted mode APORT0YCH10 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH11               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH11 << 16) /**< Shifted mode APORT0YCH11 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH12               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH12 << 16) /**< Shifted mode APORT0YCH12 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH13               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH13 << 16) /**< Shifted mode APORT0YCH13 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH14               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH14 << 16) /**< Shifted mode APORT0YCH14 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH15               (_VDAC_OPA_OUT_APORTOUTSEL_APORT0YCH15 << 16) /**< Shifted mode APORT0YCH15 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH0                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH0 << 16)  /**< Shifted mode APORT1XCH0 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH2                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH2 << 16)  /**< Shifted mode APORT1XCH2 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH4                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH4 << 16)  /**< Shifted mode APORT1XCH4 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH6                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH6 << 16)  /**< Shifted mode APORT1XCH6 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH8                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH8 << 16)  /**< Shifted mode APORT1XCH8 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH10               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH10 << 16) /**< Shifted mode APORT1XCH10 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH12               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH12 << 16) /**< Shifted mode APORT1XCH12 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH14               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH14 << 16) /**< Shifted mode APORT1XCH14 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH16               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH16 << 16) /**< Shifted mode APORT1XCH16 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH18               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH18 << 16) /**< Shifted mode APORT1XCH18 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH20               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH20 << 16) /**< Shifted mode APORT1XCH20 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH22               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH22 << 16) /**< Shifted mode APORT1XCH22 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH24               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH24 << 16) /**< Shifted mode APORT1XCH24 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH26               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH26 << 16) /**< Shifted mode APORT1XCH26 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH28               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH28 << 16) /**< Shifted mode APORT1XCH28 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH30               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1XCH30 << 16) /**< Shifted mode APORT1XCH30 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH1                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH1 << 16)  /**< Shifted mode APORT1YCH1 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH3                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH3 << 16)  /**< Shifted mode APORT1YCH3 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH5                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH5 << 16)  /**< Shifted mode APORT1YCH5 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH7                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH7 << 16)  /**< Shifted mode APORT1YCH7 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH9                (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH9 << 16)  /**< Shifted mode APORT1YCH9 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH11               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH11 << 16) /**< Shifted mode APORT1YCH11 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH13               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH13 << 16) /**< Shifted mode APORT1YCH13 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH15               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH15 << 16) /**< Shifted mode APORT1YCH15 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH17               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH17 << 16) /**< Shifted mode APORT1YCH17 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH19               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH19 << 16) /**< Shifted mode APORT1YCH19 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH21               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH21 << 16) /**< Shifted mode APORT1YCH21 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH23               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH23 << 16) /**< Shifted mode APORT1YCH23 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH25               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH25 << 16) /**< Shifted mode APORT1YCH25 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH27               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH27 << 16) /**< Shifted mode APORT1YCH27 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH29               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH29 << 16) /**< Shifted mode APORT1YCH29 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH31               (_VDAC_OPA_OUT_APORTOUTSEL_APORT1YCH31 << 16) /**< Shifted mode APORT1YCH31 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH1                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH1 << 16)  /**< Shifted mode APORT2XCH1 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH2                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH2 << 16)  /**< Shifted mode APORT2XCH2 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH5                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH5 << 16)  /**< Shifted mode APORT2XCH5 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH7                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH7 << 16)  /**< Shifted mode APORT2XCH7 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH9                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH9 << 16)  /**< Shifted mode APORT2XCH9 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH11               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH11 << 16) /**< Shifted mode APORT2XCH11 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH13               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH13 << 16) /**< Shifted mode APORT2XCH13 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH15               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH15 << 16) /**< Shifted mode APORT2XCH15 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH17               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH17 << 16) /**< Shifted mode APORT2XCH17 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH19               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH19 << 16) /**< Shifted mode APORT2XCH19 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH21               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH21 << 16) /**< Shifted mode APORT2XCH21 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH23               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH23 << 16) /**< Shifted mode APORT2XCH23 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH25               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH25 << 16) /**< Shifted mode APORT2XCH25 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH27               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH27 << 16) /**< Shifted mode APORT2XCH27 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH29               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH29 << 16) /**< Shifted mode APORT2XCH29 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH31               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2XCH31 << 16) /**< Shifted mode APORT2XCH31 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH0                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH0 << 16)  /**< Shifted mode APORT2YCH0 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH2                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH2 << 16)  /**< Shifted mode APORT2YCH2 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH4                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH4 << 16)  /**< Shifted mode APORT2YCH4 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH6                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH6 << 16)  /**< Shifted mode APORT2YCH6 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH8                (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH8 << 16)  /**< Shifted mode APORT2YCH8 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH10               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH10 << 16) /**< Shifted mode APORT2YCH10 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH12               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH12 << 16) /**< Shifted mode APORT2YCH12 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH14               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH14 << 16) /**< Shifted mode APORT2YCH14 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH16               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH16 << 16) /**< Shifted mode APORT2YCH16 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH18               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH18 << 16) /**< Shifted mode APORT2YCH18 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH20               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH20 << 16) /**< Shifted mode APORT2YCH20 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH22               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH22 << 16) /**< Shifted mode APORT2YCH22 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH24               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH24 << 16) /**< Shifted mode APORT2YCH24 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH26               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH26 << 16) /**< Shifted mode APORT2YCH26 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH28               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH28 << 16) /**< Shifted mode APORT2YCH28 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH30               (_VDAC_OPA_OUT_APORTOUTSEL_APORT2YCH30 << 16) /**< Shifted mode APORT2YCH30 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH0                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH0 << 16)  /**< Shifted mode APORT3XCH0 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH2                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH2 << 16)  /**< Shifted mode APORT3XCH2 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH4                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH4 << 16)  /**< Shifted mode APORT3XCH4 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH6                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH6 << 16)  /**< Shifted mode APORT3XCH6 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH8                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH8 << 16)  /**< Shifted mode APORT3XCH8 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH10               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH10 << 16) /**< Shifted mode APORT3XCH10 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH12               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH12 << 16) /**< Shifted mode APORT3XCH12 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH14               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH14 << 16) /**< Shifted mode APORT3XCH14 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH16               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH16 << 16) /**< Shifted mode APORT3XCH16 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH18               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH18 << 16) /**< Shifted mode APORT3XCH18 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH20               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH20 << 16) /**< Shifted mode APORT3XCH20 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH22               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH22 << 16) /**< Shifted mode APORT3XCH22 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH24               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH24 << 16) /**< Shifted mode APORT3XCH24 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH26               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH26 << 16) /**< Shifted mode APORT3XCH26 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH28               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH28 << 16) /**< Shifted mode APORT3XCH28 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH30               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3XCH30 << 16) /**< Shifted mode APORT3XCH30 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH1                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH1 << 16)  /**< Shifted mode APORT3YCH1 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH3                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH3 << 16)  /**< Shifted mode APORT3YCH3 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH5                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH5 << 16)  /**< Shifted mode APORT3YCH5 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH7                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH7 << 16)  /**< Shifted mode APORT3YCH7 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH9                (_VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH9 << 16)  /**< Shifted mode APORT3YCH9 for VDAC_OPA_OUT */
#define VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH11               (_VDAC_OPA_OUT_APORTOUTSEL_APORT3YCH11 << 16) /**< Shifted mode APORT3YCH11 for VDAC_OPA_OUT */
